--
-- PostgreSQL database dump
--

\restrict GPEvdHcMvbsgmbq5I7LaWWQSAz0PDWgOpF4RVz7fNjVuZAJbXJduUDcOXDeaOuO

-- Dumped from database version 14.3
-- Dumped by pg_dump version 17.7

-- Started on 2026-05-09 16:11:12

SET statement_timeout = 0;
SET lock_timeout = 0;
SET idle_in_transaction_session_timeout = 0;
SET transaction_timeout = 0;
SET client_encoding = 'UTF8';
SET standard_conforming_strings = on;
SELECT pg_catalog.set_config('search_path', '', false);
SET check_function_bodies = false;
SET xmloption = content;
SET client_min_messages = warning;
SET row_security = off;

SET default_tablespace = '';

SET default_table_access_method = heap;

--
-- TOC entry 352 (class 1259 OID 26902286)
-- Name: petition_form_province; Type: TABLE; Schema: public; Owner: postgres
--

CREATE TABLE public.petition_form_province (
    id integer NOT NULL,
    datetime_create timestamp with time zone,
    datetime_update timestamp with time zone,
    name text NOT NULL,
    code integer NOT NULL
);


ALTER TABLE public.petition_form_province OWNER TO postgres;

--
-- TOC entry 353 (class 1259 OID 26902291)
-- Name: petition_form_province_id_seq; Type: SEQUENCE; Schema: public; Owner: postgres
--

CREATE SEQUENCE public.petition_form_province_id_seq
    AS integer
    START WITH 1
    INCREMENT BY 1
    NO MINVALUE
    NO MAXVALUE
    CACHE 1;


ALTER SEQUENCE public.petition_form_province_id_seq OWNER TO postgres;

--
-- TOC entry 3898 (class 0 OID 0)
-- Dependencies: 353
-- Name: petition_form_province_id_seq; Type: SEQUENCE OWNED BY; Schema: public; Owner: postgres
--

ALTER SEQUENCE public.petition_form_province_id_seq OWNED BY public.petition_form_province.id;


--
-- TOC entry 3748 (class 2604 OID 26902556)
-- Name: petition_form_province id; Type: DEFAULT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.petition_form_province ALTER COLUMN id SET DEFAULT nextval('public.petition_form_province_id_seq'::regclass);


--
-- TOC entry 3890 (class 0 OID 26902286)
-- Dependencies: 352
-- Data for Name: petition_form_province; Type: TABLE DATA; Schema: public; Owner: postgres
--

COPY public.petition_form_province (id, datetime_create, datetime_update, name, code) FROM stdin;
45	2022-10-29 12:23:56.82226+07	2022-10-29 17:15:00.942767+07	ร้อยเอ็ด	45
46	2022-10-29 12:23:56.827243+07	2022-10-29 17:15:00.944586+07	กาฬสินธุ์	46
53	2022-10-29 12:23:56.85717+07	2022-10-29 17:15:00.958493+07	อุตรดิตถ์	53
54	2022-10-29 12:23:56.859157+07	2022-10-29 17:15:00.960482+07	แพร่	54
62	2022-10-29 12:23:56.885091+07	2022-10-29 17:15:00.974879+07	กำแพงเพชร	62
63	2022-10-29 12:23:56.887083+07	2022-10-29 17:15:00.976559+07	ตาก	63
72	2022-10-29 12:23:56.909023+07	2022-10-29 17:15:00.990166+07	สุพรรณบุรี	72
73	2022-10-29 12:23:56.912015+07	2022-10-29 17:15:00.992163+07	นครปฐม	73
81	2022-10-29 12:23:56.934962+07	2022-10-29 17:15:01.006126+07	กระบี่	81
82	2022-10-29 12:23:56.93695+07	2022-10-29 17:15:01.00812+07	พังงา	82
83	2022-10-29 12:23:56.938943+07	2022-10-29 17:15:01.009197+07	ภูเก็ต	83
92	2022-10-29 12:23:56.957895+07	2022-10-29 17:15:01.023187+07	ตรัง	92
93	2022-10-29 12:23:56.966876+07	2022-10-29 17:15:01.024212+07	พัทลุง	93
94	2022-10-29 12:23:56.971856+07	2022-10-29 17:15:01.026194+07	ปัตตานี	94
11	2022-10-29 12:23:56.67465+07	2022-10-29 17:15:00.876557+07	สมุทรปราการ	11
12	2022-10-29 12:23:56.679637+07	2022-10-29 17:15:00.877539+07	นนทบุรี	12
13	2022-10-29 12:23:56.684623+07	2022-10-29 17:15:00.879177+07	ปทุมธานี	13
14	2022-10-29 12:23:56.688614+07	2022-10-29 17:15:00.882174+07	พระนครศรีอยุธยา	14
15	2022-10-29 12:23:56.691606+07	2022-10-29 17:15:00.885164+07	อ่างทอง	15
19	2022-10-29 12:23:56.713551+07	2022-10-29 17:15:00.893143+07	สระบุรี	19
20	2022-10-29 12:23:56.71956+07	2022-10-29 17:15:00.895137+07	ชลบุรี	20
21	2022-10-29 12:23:56.722523+07	2022-10-29 17:15:00.899129+07	ระยอง	21
27	2022-10-29 12:23:56.743468+07	2022-10-29 17:15:00.910096+07	สระแก้ว	27
30	2022-10-29 12:23:56.750452+07	2022-10-29 17:15:00.912121+07	นครราชสีมา	30
31	2022-10-29 12:23:56.755447+07	2022-10-29 17:15:00.914116+07	บุรีรัมย์	31
37	2022-10-29 12:23:56.781367+07	2022-10-29 17:15:00.927088+07	อำนาจเจริญ	37
38	2022-10-29 12:23:56.785373+07	2022-10-29 17:15:00.929385+07	บึงกาฬ	38
39	2022-10-29 12:23:56.791344+07	2022-10-29 17:15:00.930877+07	หนองบัวลำภู	39
40	2022-10-29 12:23:56.79633+07	2022-10-29 17:15:00.933872+07	ขอนแก่น	40
47	2022-10-29 12:23:56.832236+07	2022-10-29 17:15:00.945588+07	สกลนคร	47
48	2022-10-29 12:23:56.83622+07	2022-10-29 17:15:00.948587+07	นครพนม	48
49	2022-10-29 12:23:56.842204+07	2022-10-29 17:15:00.951919+07	มุกดาหาร	49
50	2022-10-29 12:23:56.844197+07	2022-10-29 17:15:00.953497+07	เชียงใหม่	50
51	2022-10-29 12:23:56.849185+07	2022-10-29 17:15:00.955494+07	ลำพูน	51
52	2022-10-29 12:23:56.853189+07	2022-10-29 17:15:00.956522+07	ลำปาง	52
55	2022-10-29 12:23:56.861151+07	2022-10-29 17:15:00.96189+07	น่าน	55
56	2022-10-29 12:23:56.867141+07	2022-10-29 17:15:00.962893+07	พะเยา	56
57	2022-10-29 12:23:56.871126+07	2022-10-29 17:15:00.966882+07	เชียงราย	57
58	2022-10-29 12:23:56.874118+07	2022-10-29 17:15:00.969871+07	แม่ฮ่องสอน	58
60	2022-10-29 12:23:56.876111+07	2022-10-29 17:15:00.971395+07	นครสวรรค์	60
61	2022-10-29 12:23:56.878106+07	2022-10-29 17:15:00.972867+07	อุทัยธานี	61
64	2022-10-29 12:23:56.891073+07	2022-10-29 17:15:00.977559+07	สุโขทัย	64
65	2022-10-29 12:23:56.893066+07	2022-10-29 17:15:00.979573+07	พิษณุโลก	65
66	2022-10-29 12:23:56.895067+07	2022-10-29 17:15:00.982557+07	พิจิตร	66
67	2022-10-29 12:23:56.900049+07	2022-10-29 17:15:00.984573+07	เพชรบูรณ์	67
70	2022-10-29 12:23:56.903086+07	2022-10-29 17:15:00.986535+07	ราชบุรี	70
71	2022-10-29 12:23:56.907029+07	2022-10-29 17:15:00.98853+07	กาญจนบุรี	71
74	2022-10-29 12:23:56.918001+07	2022-10-29 17:15:00.99316+07	สมุทรสาคร	74
75	2022-10-29 12:23:56.921989+07	2022-10-29 17:15:00.995155+07	สมุทรสงคราม	75
76	2022-10-29 12:23:56.922986+07	2022-10-29 17:15:00.998149+07	เพชรบุรี	76
77	2022-10-29 12:23:56.924984+07	2022-10-29 17:15:01.002138+07	ประจวบคีรีขันธ์	77
80	2022-10-29 12:23:56.927975+07	2022-10-29 17:15:01.004131+07	นครศรีธรรมราช	80
84	2022-10-29 12:23:56.940939+07	2022-10-29 17:15:01.011219+07	สุราษฎร์ธานี	84
85	2022-10-29 12:23:56.943931+07	2022-10-29 17:15:01.01319+07	ระนอง	85
86	2022-10-29 12:23:56.950917+07	2022-10-29 17:15:01.01718+07	ชุมพร	86
90	2022-10-29 12:23:56.952906+07	2022-10-29 17:15:01.0197+07	สงขลา	90
95	2022-10-29 12:23:56.975846+07	2022-10-29 17:15:01.027179+07	ยะลา	95
96	2022-10-29 12:23:56.982828+07	2022-10-29 17:15:01.029175+07	นราธิวาส	96
16	2022-10-29 12:23:56.698595+07	2022-10-29 17:15:00.887158+07	ลพบุรี	16
17	2022-10-29 12:23:56.703576+07	2022-10-29 17:15:00.890152+07	สิงห์บุรี	17
18	2022-10-29 12:23:56.707564+07	2022-10-29 17:15:00.891169+07	ชัยนาท	18
22	2022-10-29 12:23:56.724517+07	2022-10-29 17:15:00.901125+07	จันทบุรี	22
23	2022-10-29 12:23:56.726512+07	2022-10-29 17:15:00.903115+07	ตราด	23
24	2022-10-29 12:23:56.734492+07	2022-10-29 17:15:00.90511+07	ฉะเชิงเทรา	24
25	2022-10-29 12:23:56.738484+07	2022-10-29 17:15:00.907105+07	ปราจีนบุรี	25
26	2022-10-29 12:23:56.741493+07	2022-10-29 17:15:00.909099+07	นครนายก	26
32	2022-10-29 12:23:56.760423+07	2022-10-29 17:15:00.917156+07	สุรินทร์	32
33	2022-10-29 12:23:56.76541+07	2022-10-29 17:15:00.920102+07	ศรีสะเกษ	33
34	2022-10-29 12:23:56.769398+07	2022-10-29 17:15:00.922127+07	อุบลราชธานี	34
35	2022-10-29 12:23:56.774386+07	2022-10-29 17:15:00.92409+07	ยโสธร	35
36	2022-10-29 12:23:56.777376+07	2022-10-29 17:15:00.925086+07	ชัยภูมิ	36
41	2022-10-29 12:23:56.802309+07	2022-10-29 17:15:00.935865+07	อุดรธานี	41
42	2022-10-29 12:23:56.8093+07	2022-10-29 17:15:00.938181+07	เลย	42
43	2022-10-29 12:23:56.812284+07	2022-10-29 17:15:00.939773+07	หนองคาย	43
44	2022-10-29 12:23:56.818271+07	2022-10-29 17:15:00.940772+07	มหาสารคาม	44
91	2022-10-29 12:23:56.9549+07	2022-10-29 17:15:01.021369+07	สตูล	91
10	2022-10-29 12:23:56.668667+07	2022-10-29 17:15:00.872564+07	กรุงเทพมหานคร	10
\.


--
-- TOC entry 3899 (class 0 OID 0)
-- Dependencies: 353
-- Name: petition_form_province_id_seq; Type: SEQUENCE SET; Schema: public; Owner: postgres
--

SELECT pg_catalog.setval('public.petition_form_province_id_seq', 1, false);


--
-- TOC entry 3750 (class 2606 OID 26905739)
-- Name: petition_form_province petition_form_province_pkey; Type: CONSTRAINT; Schema: public; Owner: postgres
--

ALTER TABLE ONLY public.petition_form_province
    ADD CONSTRAINT petition_form_province_pkey PRIMARY KEY (id);


--
-- TOC entry 3897 (class 0 OID 0)
-- Dependencies: 352
-- Name: TABLE petition_form_province; Type: ACL; Schema: public; Owner: postgres
--

GRANT SELECT ON TABLE public.petition_form_province TO vsmart_dashboard_readonly;


-- Completed on 2026-05-09 16:11:12

--
-- PostgreSQL database dump complete
--

\unrestrict GPEvdHcMvbsgmbq5I7LaWWQSAz0PDWgOpF4RVz7fNjVuZAJbXJduUDcOXDeaOuO

